 <html>
<head>
<title>Interview de Static REvenge</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style> 
a{text-decoration:none}
TD{font-family: Verdana; font-size: x-small;}
body{
	scrollbar-3d-Light-Color : #646884;
	scrollbar-Base-Color : #646884;
	scrollbar-Dark-Shadow-Color : #646884;
	scrollbar-Face-Color : #EDECF0;
	scrollbar-Highlight-Color :#646884;
	scrollbar-Shadow-Color :#646884;
	scrollbar-Track-Color : #FFFFFF;
}
a:hover{color:#EB1F15}
A:link    {text-decoration: none;}
A:active  {text-decoration: none;}
A:visited {text-decoration: none;}
A:hover   {text-decoration: underline;}
</style>
</head>
<body bgcolor="#FFFFFF" text="#000000">
<p align="center"><img src="banzzz/interview100.jpg" width="552" height="82"><br>
  <font color="#666666" size="-1">- Interview r&eacute;alis&eacute;e le 03/10/2002 
  sur le chan IRC de la ShmeitCorp -</font></p>
<hr width="95%">
<p>&nbsp;</p>
<table width="40%" border="1" align="center" cellpadding="2" cellspacing="0">
  <tr> 
    <td width="31%" height="54"><div align="center">Static REvenge</div></td>
    <td width="31%" rowspan="2"><div align="center"><img src="img/stat.jpg" alt="La photo de Stat' ;)" width="54" height="72" border="1"></div></td>
  </tr>
  <tr> 
    <td><div align="center"><a href="http://www.shmeitcorp.tk/" target="_blank">http://www.shmeitcorp.tk</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
<table width="98%" border="0" align="center">
  <tr>
    <td><p><font color="#0000FF">&lt;SeVeN&gt;</font> Salut Static ! Pour commencer, 
        qui es-tu ? Pr&eacute;sente toi un peu :<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Bonjour, sur la sc&egrave;ne 
        cracking-fr, je m'appelle Static REvenge, ou Stat' pour les intimes. Je 
        suis assez jeune et passionn&eacute; d'informatique depuis mon enfance.. 
        on va dire depuis 10 ans environ.. En dehors de &ccedil;a, j'aime bien 
        la musique et lire quelques bouquins d'auteurs inconnus voir oubli&eacute;s, 
        et bien s&ucirc;r jardiner ! J'aime beaucoup la nature :)</p>
      <p><font color="#0000FF">&lt;SeVeN&gt;</font> Et d'o&ugrave; te vient ton 
        pseudo ? <br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Franchement, je ne 
        m'en souviens plus... je crois que c'est parce que j'avais r&eacute;ussi 
        &agrave; craquer mon premier programme (un jeu of course) apr&egrave;s 
        plusieurs essais, devant mon PC sans bouger, alors j'avais eu ma &quot;revenche 
        statique&quot; d'o&ugrave; ce pseudo. Quant au RE, c'est juste une ancienne 
        faute de frappe (j'en suis sp&eacute;cialiste) qui est rest&eacute;e :)</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> L'informatique pour toi, 
        aujourd'hui qu'est ce que c'est exactement ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Aujourd'hui l'informatique 
        est pour moi une forme d'expression, voir d'art et aussi un superbe domaine, 
        tr&egrave;s vaste et remplis de bonnes choses. Sinon en ce qui concerne 
        son utilisation courante, je trouve dommage que la &quot;nouvelle g&eacute;n&eacute;ration&quot; 
        soit form&eacute;e que s&ucirc;r du GUI.. on y gagne en simplicit&eacute; 
        mais pas en puissance (vive la ligne de commande - hors sujet). Bref, 
        l'informatique reste une plan&egrave;te aux paysages infinis :)<br>
        <font color="#0000FF">&lt;SeVeN&gt;</font> C'est tr&egrave;s beau ce que 
        tu dis ;)</p>
      <p><font color="#0000FF">&lt;SeVeN&gt;</font> Quel sont les meilleurs magazines 
        info en ce moment d'apr&egrave;s toi ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Aucun.. c'est &agrave; 
        dire que pass&eacute; un certain niveau, tu vas plus chercher les news 
        sur internet et apprendre avec de bons bouquins fais pas des sp&eacute;cialistes 
        (enfin.. c'en est pas toujours :))</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> Professionnellement parlant, 
        dans quoi travailles-tu ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Actuellement je suis 
        administrateur de bases Oracle sous Unix/SunOS pour le compte d'une grosse 
        soci&eacute;t&eacute; d'import/export.</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> Qu'est ce que tu ex&egrave;cres 
        le plus aujourd'hui dans le monde informatique ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> La position assise 
        :)<br>
        <font color="#0000FF">&lt;SeVeN&gt;</font> LoL !<br>
        <font color="#0000FF">&lt;SeVeN&gt;</font> et c'est tout ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> surtout &ccedil;a, 
        sinon je m'int&eacute;resse beaucoup &agrave; la s&eacute;curit&eacute; 
        des nouvelles technologies et aussi des services internet tel que Apache 
        dont je suis contributeur en code. (comme par exemple pour le dernier 
        module SSL et le projet Jakarta)</p>
      <p><font color="#0000FF">&lt;SeVeN&gt;</font> Tiens, et qu'est ce que le 
        projet Jakarta ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Jakarta est un projet 
        de la base de logiciel d'Apache, charg&eacute; de la cr&eacute;ation et 
        de l'entretien de la commercial-qualit&eacute;, en open-source. Et aussi 
        pour offrir des solutions de serveurs pour la plateforme Java.</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> Ton cot&eacute; hackeur est-il 
        aussi &quot;d&eacute;velopp&eacute;&quot; que ton cot&eacute; crackeur 
        ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> l&agrave; c'est difficile 
        &agrave; dire, d&eacute;j&agrave; je pense avoir le m&ecirc;me niveau 
        dans les deux domaines.. en fait &ccedil;a d&eacute;pend des p&eacute;riodes, 
        &ccedil;a m'est d&eacute;j&agrave; arriv&eacute; de l&acirc;cher le cracking 
        pendant plusieurs mois, et vice-versa. En fait &agrave; l'origine je suis 
        cracker mais je suis devenue un peu hacker sans vraiment le faire expr&egrave;s.</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> As tu d&eacute;j&agrave; 
        connu des probl&egrave;mes avec la justice vis &agrave; vis de l'informatique 
        ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Oui quand j'avais 
        12 ans, avec un amis on avait mis tous le HLM sur &eacute;coute, sois 
        plus de 100 locataires, et on s'amusait &agrave; faire des compils sur 
        k7 audio. Malheureusement, on ne sait pas trop comment mais les gendarmes 
        ont appris &ccedil;a et ont d&eacute;barqu&eacute; chez mes parents.. 
        Mais nous n'avons rien eu, &agrave; l'&eacute;poque les lois &eacute;taient 
        beaucoup plus souples que maintenant.<br>
        <font color="#0000FF">&lt;SeVeN&gt;</font> mdr !<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> c'&eacute;tait juste 
        pour se marrer :) </p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> Pourquoi pratiques-tu le 
        cracking, le hacking, le phreaking et le social engineering ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Le cracking par simple 
        curiosit&eacute;, j'ai toujours aim&eacute; savoir comment fonctionnait 
        un syst&egrave;me. D&eacute;j&agrave; tout petit de d&eacute;montais mes 
        jouets.. Le hacking j'en sais trop rien, j'ai gliss&eacute; dessus, c'est 
        sympa et puis il vaut mieux avoir certaines bases. Disons que c'est plus 
        pour se prot&eacute;ger qu'autre chose.. Le phreaking, parce que je trouve 
        &ccedil;a marrant de voir &agrave; quel point on peu &ecirc;tre espionn&eacute; 
        facilement et aussi d&eacute;tourner des communications, m&ecirc;me si 
        c'est devenue de plus en plus difficile.. et enfin le Social Engineering, 
        je ne pratique que tr&egrave;s rarement, mais bon, c'est plus par obligation 
        ;)</p>
      <p><font color="#0000FF">&lt;SeVeN&gt;</font> Quelles ont &eacute;t&eacute; 
        les personnes qui ont inspir&eacute; ta *carri&egrave;re* ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> En fait, &agrave; 
        l'origine personne, puis certains m'ont fait un peu r&ecirc;ver comme 
        ce cher Xoanon de l'UCF. Mais sans r&eacute;el plus, c'&eacute;tait avant 
        tout une sorte de qu&ecirc;te personnelle, ce qui n'emp&ecirc;che pas 
        l'&eacute;change d'id&eacute;es ;)<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Par exemple Xoanon 
        m'a fait r&ecirc;ver par son savoir faire en terme de reverse engineering, 
        avec son excellente release de Bleem! &agrave; l'&eacute;poque.</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> Et tu penses maintenant avoir 
        atteint voir d&eacute;pass&eacute; son niveau &agrave; cette &eacute;poque 
        ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> En fait non pas vraiment, 
        certains ressemblent plus &agrave; des extra-terrestres et d'autres &agrave; 
        des &ecirc;tre humains, comme moi :)<br>
        <font color="#0000FF">&lt;SeVeN&gt;</font> lol ;) !</p>
<p> <font color="#0000FF">&lt;SeVeN&gt;</font> Parle moi de la Shmeit Corp 
        !<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Ah... pour moi la 
        SC rime avec Aventure. Et oui, ce groupe a en fait &eacute;t&eacute; cr&eacute;&eacute; 
        en 1995 par Smeita puis support&eacute; par un autre groupe connu &agrave; 
        l'&eacute;poque, l'ECC. Mais bon, je raccourci un peu ce passage [...] 
        pour arriver en 2000, ann&eacute;e o&ugrave; la SC prend bien son envole, 
        avec une flop&eacute; de nouveaux crackers.. pas si nouveaux en fait, 
        Internet servant juste &agrave; nous rencontrer &agrave; la base. Puis 
        la machine tournait bien jusqu'en fin 2001.. Quelques arrestations nous 
        ont oblig&eacute;e &agrave; refaire notre site et &agrave; enlever nos 
        releases (plus de 600 &agrave; l'&eacute;poque), pour plus de s&eacute;curit&eacute;. 
        On en a profit&eacute; pour s'axer tuts et autres outils. En fait le probl&egrave;me 
        &agrave; l'&eacute;poque est qu'&agrave; un moment nous &eacute;tions 
        trop connu et la DST frappait de plein fouet (&ccedil;a n'est pas de l'intox 
        je vous garantie)<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Maintenant la DST 
        en &agrave; un peu marre et les nouveaux groupes ont raison d'&ecirc;tre 
        un peu plus tranquille :)<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Quand aux membres, 
        nous sommes un peu comme une grande famille toujours joyeuse :)</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> Et toi tu n'as pas eu de 
        probl&egrave;me &agrave; ce moment la ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Non mais c'&eacute;tait 
        juste. Conseil aux nouveaux : ne donnez jamais vos coordonn&eacute;es 
        personnelles! M&ecirc;me si le gars &agrave; l'autre bout est sympa avec 
        vous depuis un an.</p>
      <p><font color="#0000FF">&lt;SeVeN&gt;</font> As-tu &eacute;t&eacute; pr&eacute;c&eacute;demment 
        dans une autre team ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt; </font>Avant j'&eacute;tais 
        avec quelques potes mais on n'avais pas vraiment de nom de groupe, c'&eacute;tait 
        pas notre truc... A par &ccedil;a question cracking, j'ai toujours &eacute;t&eacute; 
        dans la ShmeitCorp.. Question hacking reseaux c'est en train de se faire...</p>
      <p><font color="#0000FF">&lt;SeVeN&gt;</font> Hoho ! des projets mais c'est 
        top secret encore c'est ca ;) ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Pas vraiment mais 
        je ne pr&eacute;f&egrave;re pas en parler tant que &ccedil;a n 'est pas 
        au point... au bout d'un moment il faut faire attention compte tenu des 
        risques pris (pur&eacute;, on se croirait dans un mauvais film :))</p>
      <p><font color="#0000FF">&lt;SeVeN&gt;</font> Sur quel(s) syst&egrave;me(s) 
        travailles-tu ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Chez moi sous Windows 
        NT pour la d&eacute;tente, mais on se limite vite au GUI, alors pour faire 
        des applications ou simplement des tests pouss&eacute;s, je bascule sur 
        des syst&egrave;mes de type Unix comme OpenBSD ou Linux dont la Mandrake 
        v9 qui est excellente.</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> Retour au cracking: quel 
        crack a &eacute;t&eacute; &agrave; tes yeux le plus difficile &agrave; 
        r&eacute;aliser ? et le plus facile lol ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Le plus difficile 
        a s&ucirc;rement &eacute;t&eacute; celui pour Autocad 12 &agrave; l'&eacute;poque, 
        et le plus simple 1toX 1.0</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> Tu peux expliquer rapidement 
        pourquoi ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Autocad parce qu'&agrave; 
        l'&eacute;poque il utilisait un dongle nouvelle g&eacute;n&eacute;ration 
        qui n'avait rien &agrave; voir avec ce qui se faisait. Pour 1toX, j'ai 
        mis &agrave; peine 5 secs pour enlever le nag de sortie en pla&ccedil;ant 
        un octet 00 devant le string data de la fen&ecirc;tre du nag, c'est juste 
        une exploitation d'un ancien bug dans les compilateurs c/cpp.</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> Des projets pour ton avenir 
        ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Oui, ma femme :) A 
        part &ccedil;a je continue &agrave; filer mon bonhomme de chemin et j'ai 
        toujours eu un peu de chance, j'esp&egrave;re que &ccedil;a continuera 
        et que je pourrais faire ce que j'aime comme type de boulot, c'est &agrave; 
        dire &ecirc;tre informaticien.</p>
      <p> <font color="#0000FF">&lt;SeVeN&gt;</font> Un truc &agrave; ajouter 
        pour la post&eacute;rit&eacute; ? ;)<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> Les newbies d'aujourd'hui 
        sont les &eacute;lites de demain.. Et puis, mangez des radis!! :)</p>
      <p><font color="#0000FF">&lt;SeVeN&gt;</font> Pour conclure, y a-t-il des 
        gens que tu souhaites remercier ou insulter ?<br>
        <font color="#FF0000">&lt;Static_REvenge&gt;</font> En ce moment, toi 
        pour l'interview et puis aussi toutes les personnes de bonne volont&eacute;.. 
        Quant aux insultes, oui, &ccedil;a serait pour mon vieux 15&quot; qui 
        m'a lach&eacute; hier! :)<br>
        <font color="#0000FF">&lt;SeVeN&gt;</font> LoL ;))))))<br>
      </p>
      <p align="center"><em>Je remercie Static REvenge d'avoir bien voulu perdre 
        de son temps, tr&egrave;s tard dans la nuit ;), pour r&eacute;pondre &agrave; 
        mes questions ;)</em></p>
      </td>
  </tr>
</table>
<p><br>
</p>
</body>
</html>
