<html>
<head>
<title>-=&curren; Labo Skopia &curren;=-</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Yoyo">
<meta name="keywords" content="reverse engineering,
							   informatique,
							   informatics,
							   computer science,
							   programmation,
							   programming,
							   coding,
							   assembleur,
							   assembler,
							   asm,
							   C,
							   C++,
							   java,
							   sécurité,
							   security,
							   computer security,
							   sécurité informatique,
							   microprocesseur,
							   microprocessor,
							   debugger,
							   debugging,
							   cpu,
							   intel,
							   pentium,
							   x86,
							   80x86,
							   286,
							   386,
							   asm,
							   softice,
							   ntice,
							   trace,
							   anti-cracking,
							   exploit">
<meta name="description" content="Ligue des Assoiffés de Bricolage sur Ordinateur">
<meta name="copyright" content="Labo-Asso">
<meta name="robots" content="all">
<link href="../css/css.css" rel="stylesheet" type="text/css">
</head><body>
<script language="JavaScript" type="text/JavaScript">
	var fond = "/images/fond.gif";
	var aleatoire = Math.round(Math.random(0)*2) ^ Math.round(Math.random(0)*2);	
	//var img_back = document.body.background;
	//var index = img_back.lastIndexOf ("/");
	
	if (aleatoire) fond = "/images/fond_2.gif";
	document.body.background = fond; 
	

                              <td><img src="../../images/pixel_transp.gif" width="1" height="1"></td>
                            </tr>
                          </table>
                          <p align="center"><font color="#00FFFF" size="5"><a name="methode_3"></a>Kernel 
                            Mode</font><br>
                            <font color="#00FFFF">m&eacute;thode 3</font></p>
                          <p> 
                          <table border="0" align="center" cellpadding="1" cellspacing="0" bgcolor="#339999">
                            <tr> 
                              <td><table border="0" cellpadding="4" cellspacing="0" bgcolor="#000000">
                                  <tr> 
                                    <td><a href="../../download/passive_level_save_all_idt_gdt.zip" target="_blank"><img src="../../images/download.gif" width="64" height="14" border="0"></a></td>
                                  </tr>
                                </table></td>
                            </tr>
                          </table></p>
                          <p align="justify"><font color="#00FFFF" size="4">ALL_LEVEL 
                            (IRQL=0 &agrave; 31)</font></p>
                          <p align="justify">Cette derni&egrave;re technique permet 
                            d'obtenir ce que l'on d&eacute;sire sans d&eacute;pendre 
                            de l'irql courant. Elle est directement inspir&eacute;e 
                            de celle utilis&eacute;e par Softice pour soutirer 
                            les informations dont il a besoin. C'est celle que 
                            je pr&eacute;f&egrave;re :)</p>
                          <p align="justify">Dans un syst&egrave;me NT, la couche 
                            la plus basse se nomme HAL. C'est la couche d'abstraction 
                            mat&eacute;rielle. Cette couche communique directement 
                            avec le mat&eacute;riel (hardware). Il n'y a donc 
                            rien d'&eacute;tonnant &agrave; trouver les routines 
                            d'initialisation des cpu &agrave; cet endroit :)</p>
                          <p align="justify">Chaque CPU est d&eacute;finie par 
                            un objet nomm&eacute; PCR (Processor Control Region). 
                            C'est dans cette r&eacute;gion que l'on trouve tout 
                            l'environnement courant du cpu. Et c'est donc dans 
                            cette r&eacute;gion que l'on trouve les tables IDT 
                            et GDT propres au cpu. :)</p>
                          <table border="0" align="center" cellpadding="1" cellspacing="0" bgcolor="#33CC33">
                            <tr> 
                              <td> <table border="0" cellpadding="10" cellspacing="0" bgcolor="#000000">
                                  <tr> 
                                    <td>lkd&gt; dt _kpcr<br>
                                      nt!_KPCR<br>
                                      +0x000 NtTib : _NT_TIB<br>
                                      +0x01c SelfPcr : Ptr32 _KPCR<br>
                                      +0x020 Prcb : Ptr32 _KPRCB<br>
                                      +0x024 Irql : UChar<br>
                                      +0x028 IRR : Uint4B<br>
                                      +0x02c IrrActive : Uint4B<br>
                                      +0x030 IDR : Uint4B<br>
                                      +0x034 KdVersionBlock : Ptr32 Void<br> <font color="#00FFFF">+0x038 
                                      IDT : Ptr32 _KIDTENTRY<br>
                                      +0x03c GDT : Ptr32 _KGDTENTRY</font><br>
                                      +0x040 TSS : Ptr32 _KTSS<br>
                                      +0x044 MajorVersion : Uint2B<br>
                                      +0x046 MinorVersion : Uint2B<br>
                                      +0x048 SetMember : Uint4B<br>
                                      +0x04c StallScaleFactor : Uint4B<br>
                                      +0x050 DebugActive : UChar<br>
                                      +0x051 Number : UChar<br>
                                      +0x052 Spare0 : UChar<br>
                                      +0x053 SecondLevelCacheAssociativity : UChar<br>
                                      +0x054 VdmAlert : Uint4B<br>
                                      +0x058 KernelReserved : [14] Uint4B<br>
                                      +0x090 SecondLevelCacheSize : Uint4B<br>
                                      +0x094 HalReserved : [16] Uint4B<br>
                                      +0x0d4 InterruptMode : Uint4B<br>
                                      +0x0d8 Spare1 : UChar<br>
                                      +0x0dc KernelReserved2 : [17] Uint4B<br>
                                      +0x120 PrcbData : _KPRCB</td>
                                  </tr>
                                </table></td>
                            </tr>
                          </table>
                          <p align="justify">Lorsque les objets PCR sont cr&eacute;&eacute;s, 
                            ntoskrnl appelle la routine HalInitializeProcessor 
                            afin d'initialiser chaque cpu et permettre &agrave; 
                            tout ce beau monde de fonctionner ensemble. Cette 
                            routine se trouve dans hal.dll. C'est HalInitializeProcessor 
                            qui a la charge de stocker les pointeurs de tous les 
                            objets PCR. Pour cela, elle a &agrave; sa disposition 
                            la table nomm&eacute;e HalpProcessorPCR. Sympa la 
                            table ! :)<br>
